c:\temp\dirty_debug.txt


[2026-01-14T18:59:49.788Z] Sending POST to http://www.dneonline.com/calculator.asmx
Body: 
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:06:16.028Z] Sending POST to http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso
Body: 
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:06:47.876Z] Sending POST to http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso
Body: 
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:13:00.245Z] Sending POST to http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso
Body: 
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:13:22.793Z] Sending POST to http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso
Body: 
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:15:39.189Z] Sending POST to http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso
Body: 
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:26:26.948Z] Sending POST to http://www.dneonline.com/calculator.asmx
Body: <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>7</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
Headers: {"Content-Type":"text/xml; charset=utf-8","SOAPAction":"http://tempuri.org/Add"}

[2026-01-14T19:26:35.138Z] Sending POST to http://localhost:5267/Service.asmx
Body: <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>52</intA>
      <intB>7</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:26:41.870Z] Sending POST to http://localhost:5267/Service.asmx
Body: <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>52</intA>
      <intB>7</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:32:32.085Z] Sending POST to http://www.dneonline.com/calculator.asmx
Body: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <!--Optional:-->
         <intA>2</intA>
         <intB>2</intB>

      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:38:15.737Z] Sending POST to http://www.dneonline.com/calculator.asmx
Body: <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>7</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:38:23.538Z] Sending POST to http://www.dneonline.com/calculator.asmx
Body: <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>37</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
Headers: {"Content-Type":"text/xml"}

[2026-01-14T19:38:49.387Z] Sending POST to http://www.dneonline.com/calculator.asmx
Body: <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>7</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
Headers: {"Content-Type":"text/xml; charset=utf-8","SOAPAction":"http://tempuri.org/Add"}
